{"id":3987,"date":"2018-10-19T10:04:52","date_gmt":"2018-10-19T10:04:52","guid":{"rendered":"http:\/\/photocontestdeadlines.com\/?page_id=3987"},"modified":"2018-10-19T10:04:52","modified_gmt":"2018-10-19T10:04:52","slug":"privacy-policy-terms-of-use","status":"publish","type":"page","link":"https:\/\/photocontestdeadlines.com\/privacy-policy-terms-of-use\/","title":{"rendered":"Privacy Policy &#038; Terms of Use"},"content":{"rendered":"<p>Respecting the rights of the Internet users is very important to us, especially protection of their privacy. The terms of use laid down below explain how we collect and process the data of our users.<\/p>\n<p>The content of the Terms of Use and Privacy Policy \/ Cookies subpage is subject to change. The user is informed about the latest update to the Privacy Policy through updates to the date displayed on the bottom of the subpage, which is why we encourage to visit it regularly.<\/p>\n<h2>Using the website<\/h2>\n<p>The <a href=\"http:\/\/photocontestdeadlines.com\"><strong>Photo Contest Deadlines<\/strong><\/a> is intended for personal use. When using the website, the user has to comply with all the provisions in force in European Union related to browsing websites as well as the provisions of the international law.<\/p>\n<p>The website’s publisher may suspend any user’s account with a notification or without it, without giving any reason.<\/p>\n<h3>Registering an account<\/h3>\n<p>By providing your personal data when registering an account (username and e-mail address) you agree to have it processed for marketing purposes, including direct marketing by the publisher of the <a href=\"http:\/\/photocontestdeadlines.com\"><strong>Photo Contest Deadlines<\/strong><\/a> website. By direct marketing we mean periodical mailing notifying about selected photography contests.<\/p>\n<h3>Newsletter<\/h3>\n<p>By providing your personal data (your name and e-mail address) you agree to have it processed for marketing purposes, including direct marketing by the publisher of the <a href=\"http:\/\/photocontestdeadlines.com\"><strong>Photo Contest Deadlines<\/strong><\/a>. By direct marketing we mean periodical mailing notifying about selected photography contests. We promise not to send you spam and not to write to you too often!<\/p>\n<h3>Personal data<\/h3>\n<p>Providing any data is voluntary. The user may at any moment review, modify and ask the Publisher to delete personal data (name, username, e-mail and other data provided) any time without giving a reason.<\/p>\n<h2>Cookies<\/h2>\n<h3>Cookie files used on this website.<\/h3>\n<p>By using the website, you agree to the use of cookie files according to the rules laid down below.<\/p>\n<h3>The advantages of using cookies.<\/h3>\n<p>When browsing the <a href=\"http:\/\/photocontestdeadlines.com\"><strong>Photo Contest Deadlines<\/strong><\/a>, the user’s device may have so-called cookie files stored on it. Our website utilizes cookie files, just like most of websites on the Internet, in order to ensure its best operation. Cookie files are small text files stored on a computer or a cell phone while browsing websites.<\/p>\n<p><span style=\"text-decoration: underline;\">Cookie files that we utilize serve the following purposes:<\/span><br \/>\n&#8211; they allow our website to work properly and as expected,<br \/>\n&#8211; they make it possible to stay logged in during subsequent visits to the website,<br \/>\n&#8211; they remember the website’s settings during visits and between them,<br \/>\n&#8211; they improve the speed of operation and data safety of the website,<br \/>\n&#8211; they make it possible to integrate and share content on social media like Facebook,<br \/>\n&#8211; they help us improve the website so that it is better tailored to the users’ needs,<br \/>\n&#8211; they help us display marketing content.<\/p>\n<p><span style=\"text-decoration: underline;\">We do not use cookie files to:<\/span><br \/>\n&#8211; store personal data (without the user&#8217;s explicit consent),<br \/>\n&#8211; store confidential info (without the user&#8217;s explicit consent),<br \/>\n&#8211; send data over to third parties,<\/p>\n<p>More info on the cookie files we use below.<\/p>\n<h3>Giving permission to use cookie files.<\/h3>\n<p>If the software you use to browse this website utilizes (web browser) cookie files, it means that by visiting our website you also accept using them. If you wish to browse our website without using cookie files, or delete the stored cookies, you can do so by using your browser’s settings, but it might impact proper functioning of the website.<\/p>\n<h3>The cookie files we utilize on our website.<\/h3>\n<p>We utilize cookie files for proper functioning of our website, including<br \/>\n&#8211; determining whether the user is logged in,<br \/>\n&#8211; tailoring the content to the users’ needs.<\/p>\n<p>If you do not agree to such use of cookie files, you have to leave our website and delete the browser data related to it.<\/p>\n<h3>Cookie files provided by third party entities – pageview statistics.<\/h3>\n<p><span style=\"text-decoration: underline;\">We utilize cookie files to generate anonymous pageview statistics for the website, including:<\/span><br \/>\n&#8211; number of people who visited the website over a given period of time,<br \/>\n&#8211; the type of technology utilized by the users (i.e. the type of the web browser),<br \/>\n&#8211; measuring the time spent by the users on the website,<br \/>\n&#8211; collecting data on the type of the time spent there (the activity of the users on the website, the subpages they visit),<br \/>\n&#8211; collecting data on how the users found our website,<br \/>\n&#8211; collecting data on what links on our website the users click.<\/p>\n<p>These files don’t collect any data that allows to identify individual users.<\/p>\n<h3>Cookie files provided by third party entities – social media.<\/h3>\n<p>Like most of websites, we utilize features and solutions provided by third party entities. An example of this is an integrated Facebook widget and content sharing features. Disabling these cookies will likely impact proper functioning of solutions of this type. Specific use of these files depends on the privacy settings of the user accounts on individual social media websites.<\/p>\n<h3>Disabling cookies.<\/h3>\n<p>Most web browsers makes it possible to disable cookie files. To find out more, consult the information on the website of the provider of the software you use.<\/p>\n<h2>Publishing information about contests<\/h2>\n<p>Publishing information about contests is free of charge. Submitting a contest for publication is not synonymous with a guarantee of having it displayed on the website. The publisher of the website at <a href=\"http:\/\/photocontestdeadlines.com\"><strong>Photo Contest Deadlines<\/strong><\/a><strong> <\/strong>reserves the right to publish the contests they select and to change the time of displaying information about contests.<\/p>\n<h3>Liability for the content<\/h3>\n<p>The publisher of the website at <a href=\"http:\/\/photocontestdeadlines.com\"><strong>Photo Contest Deadlines<\/strong><\/a><strong> <\/strong>takes no liability for any contests, services, information and data offered by third party entities through the aforementioned website. By sending information about a contest, the user declares that they are entitled and \/ or authorized to do so and takes any potential claims by third parties upon themselves as well as full protection of the Publisher of the <a href=\"http:\/\/photocontestdeadlines.com\"><strong>Photo Contest Deadlines<\/strong><\/a><strong> <\/strong>website regarding violation of any rights (license, payment, copyright etc.).<\/p>\n<h3>Copyright<\/h3>\n<p>The copyrights to any pictures and graphic materials published on the <a href=\"http:\/\/photocontestdeadlines.com\"><strong>Photo Contest Deadlines<\/strong><\/a><strong> <\/strong>website belong to their owners, although it is assumed that they have given permission to use them for marketing purposes on the aforementioned website.<\/p>\n<p><strong>Last updated:<\/strong> 19\/10\/2018<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Respecting the rights of the Internet users is very important to us, especially protection of their privacy. The terms of use laid down below explain how we collect and process the data of our users. The content of the Terms of Use and Privacy Policy \/ Cookies subpage is subject to change. The user is [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":0,"parent":0,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":{"footnotes":""},"aioseo_notices":[],"_links":{"self":[{"href":"https:\/\/photocontestdeadlines.com\/wp-json\/wp\/v2\/pages\/3987"}],"collection":[{"href":"https:\/\/photocontestdeadlines.com\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/photocontestdeadlines.com\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/photocontestdeadlines.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/photocontestdeadlines.com\/wp-json\/wp\/v2\/comments?post=3987"}],"version-history":[{"count":2,"href":"https:\/\/photocontestdeadlines.com\/wp-json\/wp\/v2\/pages\/3987\/revisions"}],"predecessor-version":[{"id":3989,"href":"https:\/\/photocontestdeadlines.com\/wp-json\/wp\/v2\/pages\/3987\/revisions\/3989"}],"wp:attachment":[{"href":"https:\/\/photocontestdeadlines.com\/wp-json\/wp\/v2\/media?parent=3987"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}