{"id":742,"date":"2021-01-10T20:30:42","date_gmt":"2021-01-10T20:30:42","guid":{"rendered":"http:\/\/photocontestdeadlines.com\/?page_id=742"},"modified":"2021-01-15T11:59:42","modified_gmt":"2021-01-15T11:59:42","slug":"photo-grants-scholarships","status":"publish","type":"page","link":"https:\/\/photocontestdeadlines.com\/photo-grants-scholarships\/","title":{"rendered":"Photo Grants 2021"},"content":{"rendered":"<p>Our list of <strong>International Photography Grants and Funds in 2021<\/strong> for student, amateur and professional photographers:<\/p>\n<p><strong><a href=\"http:\/\/internationalphotogrant.com\" target=\"_blank\" rel=\"noopener noreferrer\">International Photography Grant 2021<\/a><\/strong><\/p>\n<p><em>International Photography Grant awards <strong>$1000 annually<\/strong> to the applicant with the most inspirational photographic idea to support his visual project. Our grant is open for submissions without any fees (Free to Enter) to support all photographers from every corner of the world. We only accept series of photographs which share a common theme and are built as a one consistent project in the following categories: City, Fine Art, Outdoor, Story, People. We do believe that it will help a photographer to proceed and complete his project.  The Grand Prize winner and finalists will be selected by the most respected names in photographic world. Website:<a href=\"http:\/\/internationalphotogrant.com\" target=\"_blank\" rel=\"noopener noreferrer\"><strong> internationalphotogrant.com<\/strong><\/a><br \/>\n<\/em><\/p>\n<p><strong><a href=\"http:\/\/www.alexiafoundation.org\/grants\" target=\"_blank\" rel=\"noopener noreferrer\">Alexia Foundation Professional &amp; Student Grant <\/a><\/strong><\/p>\n<p><em>The Alexia Foundation offers production grants to students and professional photographers to give them the financial ability to produce substantial stories that drive change in the effort to make the world a better place. Students also get scholarship opportunities. The professional Grant recipient will receive <strong>$20,000<\/strong> for the production of the proposed project. + Student grants.<br \/>\n<\/em><\/p>\n<p><strong><a title=\"CENTER's Project Launch Grant\" href=\"http:\/\/www.visitcenter.org\/project-launch\/\" target=\"_blank\" rel=\"noopener noreferrer\">CENTER’s Project Launch Grant<\/a><\/strong><\/p>\n<p><em>This grant is awarded to complete or nearly completed projects that would benefit from the grant award package. It requires signature of a contract to participate in an exhibition during Review Santa Fe. The grant funds may be used for most expenses related to the project. Please be aware that no funds in addition to the <strong>$5,000<\/strong> are available for exhibition or travel expenses to Santa Fe.<\/em><\/p>\n<p><strong><a title=\"Lucie Foundation Emerging Scholarship\" href=\"http:\/\/www.luciefoundation.org\/education\/scholarship\/index.php\" target=\"_blank\" rel=\"noopener noreferrer\">Lucie Foundation Emerging Scholarship<\/a><\/strong><\/p>\n<p><em>The Lucie Foundation is proud to offer three cash grants to support the work of emerging photographers – one <strong>$2,500<\/strong> scholarship with an open theme and two <strong>$1000<\/strong> scholarships for photographers working in the fields of Fine Art or Documentary\/Photojournalism.<\/em><\/p>\n<p><strong><a title=\"Manuel Rivera-Ortiz Foundation for Documentary Photography and Film\" href=\"http:\/\/mrofoundation.org\/?page\/84068\/photography-grants\" target=\"_blank\" rel=\"noopener noreferrer\">Manuel Rivera-Ortiz Foundation for Documentary Photography &amp; Film Grant<\/a><\/strong><\/p>\n<p><em>We are excited to announce the opening of our 2016 call for documentary photography and film grant entries. Created to encourage the betterment of humanity through editorially-based imagery of themes including human unrest, famine, disease, politics, war, uprisings, injustice and triumph, we invite photographers and film makers to submit their applications and works through March 31, 2016. Two <strong>$5000<\/strong> awards will be announced in July 2016 during Les Rencontres d’Arles in France. <\/em><\/p>\n<p><strong><a title=\"Inge Morath Award\" href=\"http:\/\/ingemorath.org\/?page_id=131\" target=\"_blank\" rel=\"noopener noreferrer\">Inge Morath Award<\/a><\/strong><\/p>\n<p><em>The annual Inge Morath Award is given to a woman photographer under thirty years of age, to assist in the completion of a long term documentary project. The winner and finalists are selected by the photographer members of Magnum Photos and a representative of the Morath Foundation at the Magnum annual meeting.<\/em><\/p>\n<p><strong><a title=\"Aaron Siskind\" href=\"http:\/\/aaronsiskind.org\/\" target=\"_blank\" rel=\"noopener noreferrer\">Aaron Siskind Individual Photographer’s Fellowship<\/a><\/strong><\/p>\n<p><em>The Aaron Siskind Foundation is offering a limited number of Individual Photographer&#8217;s Fellowship grants of up to <strong>$10,000<\/strong> each, for artists working in photography and photo-based art. Recipients will be determined by a panel of distinguished guest judges on the basis of artistic excellence, accomplishment to date, and the promise of future achievement in the medium in its widest sense. The Foundation seeks to support artists\/photographers who demonstrate a serious commitment to the field, who are professionally active or employed in the field. <\/em><\/p>\n<p><strong><a title=\"Dorothea Lange-Paul Taylor Prize\" href=\"https:\/\/documentarystudies.duke.edu\/awards\/lange-taylor\/how-to-enter\" target=\"_blank\" rel=\"noopener noreferrer\">Dorothea Lange-Paul Taylor Prize<\/a><\/strong><\/p>\n<p><em>The winner receives <strong>$10,000<\/strong>, features in Center for Documentary Studies’ print and digital publications, and inclusion in the Archive of Documentary Arts at Rubenstein Library, Duke University.<\/em><\/p>\n<p><strong><a title=\"Eugene Smith Grant\" href=\"http:\/\/smithfund.org\/eugene-smith-grant\" target=\"_blank\" rel=\"noopener noreferrer\">Eugene Smith Grant<\/a><\/strong><\/p>\n<p><em>Grant program that provides photographers with the financial freedom to carry out or complete major photographic essays. For 2015, the amount of the grant will be <strong>$30,000<\/strong>. An additional <strong>$5,000<\/strong> in fellowship money will be dispersed, at the discretion of the jury, to one or more finalists deemed worthy of special recognition. Awards will be presented in a ceremony held in New York City.<\/em><\/p>\n<p><strong><a title=\"Getty Images Grants for Editorial Photography\" href=\"http:\/\/wherewestand.gettyimages.com\/grants\/\" target=\"_blank\" rel=\"noopener noreferrer\">Getty Images Grants for Editorial Photography<\/a><\/strong><\/p>\n<p><em>Grants for Editorial Photography, which will provide five total grants of <strong>$10,000<\/strong> each to photojournalists pursuing projects of personal and journalistic significance.<\/em><\/p>\n<p><strong><a title=\"Getty Images Emerging Talent Award\" href=\"http:\/\/wherewestand.gettyimages.com\/grants\/\" target=\"_blank\" rel=\"noopener noreferrer\">Getty Images Emerging Talent Award<\/a><\/strong><\/p>\n<p><em>Grants for Editorial Photography program, we offer an opportunity for young photographers to receive mentoring and support through our Emerging Talent Award. Applicants must be under the age of 30 at the time of submission and not associated with any agency.<\/em><\/p>\n<p><strong><a title=\"Getty Images Creative Grants\" href=\"http:\/\/wherewestand.gettyimages.com\/grants\/\" target=\"_blank\" rel=\"noopener noreferrer\">Getty Images Creative Grants<\/a><\/strong><\/p>\n<p><em>A total of eight prizes totaling <strong>$40,000<\/strong> will be offered by Getty Images to recognize, celebrate and support emerging and established photographic talent.<\/em><\/p>\n<p><strong><a title=\"Burn Magazine's Emerging Photographer Fund\" href=\"http:\/\/www.burnmagazine.org\/emerging-photographer-fund\/\" target=\"_blank\" rel=\"noopener noreferrer\">Burn Magazine’s Emerging Photographer Fund<\/a><\/strong><\/p>\n<p><em>The Emerging Photographer Grant is designed to support continuation of a photographer’s personal project. This body of work may be of either journalistic mission or purely personal artistic imperatives. The primary intent is to support emerging photographers who will become the icons of tomorrow.<\/em><\/p>\n<p><strong><a title=\"Howard Chapnick Grant\" href=\"http:\/\/smithfund.org\/howard-chapnick-grant\" target=\"_blank\" rel=\"noopener noreferrer\">Howard Chapnick Grant<\/a><\/strong><\/p>\n<p><em>The annual <strong>$5,000<\/strong> grant may be used to finance any of a range of qualified undertakings, which might include a program of further education, research, a special long-term sabbatical project, or an internship to work with a noteworthy group or individual. According to the Fund’s Board of Trustees, special consideration will be given to projects that promote social change and\/or serve significant concerns of photojournalism. The grant is not intended to be used for the production of photographs, which will continue to be funded by the main grant of the Smith Fund.<\/em><\/p>\n<p><strong><a title=\"Ian Parry Scholarship\" href=\"http:\/\/www.ianparry.org\/\" target=\"_blank\" rel=\"noopener noreferrer\">Ian Parry Scholarship<\/a><\/strong><\/p>\n<p><em>Entrants must submit a portfolio and a brief synopsis of a project they would undertake if they won the scholarship. The prize consists of <strong>£3,500<\/strong> towards their chosen assignment <strong>£500<\/strong> to those awarded Highly Commended and Commended. There is no fee for entry.<\/em><\/p>\n<p><strong><a title=\"LightWork's Artist-in-Residence\" href=\"http:\/\/www.lightwork.org\/air\/apply\" target=\"_blank\" rel=\"noopener noreferrer\">LightWork Artist-in-Residence<\/a><\/strong><\/p>\n<p><em>Each year Light Work invites 12-15 artists to participate in its residency program, including one artist co-sponsored by Autograph ABP and one artist in conjunction with the Urban Video Project (UVP). Artists selected for the residency program are invited to live in Syracuse for one month. They receive a <strong>$5,000<\/strong> stipend, an apartment to stay in, a private digital studio, a private darkroom, and 24-hour access to our facility. <\/em><\/p>\n<p><strong><a title=\"Firecracker Photographic Grant\" href=\"http:\/\/www.fire-cracker.org\/grant\/4580629146\" target=\"_blank\" rel=\"noopener noreferrer\">Firecracker Photographic Grant<\/a><\/strong><\/p>\n<p><em> The Firecracker Photographic Grant is an annual award providing funding for a female photographer to aid with the completion of a documentary photographic project. Through a combination of self-initiated fundraising and with the generous support of Genesis Imaging, the Grant fund is a minimum financial contribution of <strong>£1,000<\/strong> plus <strong>£1,000<\/strong> credit of professional printing, mounting and framing services from Genesis Imaging.<\/em><\/p>\n<p><strong><a title=\"Carmignac Gestion Photojournalism Award\" href=\"http:\/\/www.fondation-carmignac.com\/photojournalism-award\/mission\/\" target=\"_blank\" rel=\"noopener noreferrer\">Carmignac Gestion Photojournalism Award<\/a><\/strong><\/p>\n<p><em>A key aim of the Award is to support the winning photojournalist by providing a global platform for their work to be seen and collected. The Carmignac Foundation collaborates with the winner throughout the entire project by offering the laureate <strong>50,000€<\/strong> to go into the field, financing a monograph and developing and staging an international touring exhibition upon their return. Four photographs from the winner’s portfolio then enter Carmignac’s prestigious art collection.<br \/>\n<\/em><\/p>\n<p><strong><a title=\"Reminders Photography Stronghold Grants\" href=\"http:\/\/reminders-project.org\/rps\/grants\/\">Reminders Photography Stronghold Grants<\/a><\/strong><\/p>\n<p><em>Using our global network, we will be supporting the publicizing of photographers and their works, your photographic presentation or campaign, or your book launch. Any alternative proposal on photography for the best use for this gallery space is welcome – but all proposals will be reviewed and only successful proposal will receive this grant.<\/em><\/p>\n<p><strong><a title=\"The Documentary Project Fund\" href=\"http:\/\/thedocumentaryprojectfund.org\/\" target=\"_blank\" rel=\"noopener noreferrer\">The Documentary Project Fund<\/a><\/strong><\/p>\n<p><em>TheDocumentaryProjectFund was founded in 2012 as a 501(c)(3) to help make sure that photographers who want to tell the stories of their communities will be able to do so. We are here to encourage, through project support, photographers who have a community focus and a good story to tell. We believe that still photography, especially the documentary form, can be an incredibly powerful art. We can admire the beauty of each image, be challenged to think about the issues raised and come away with our biases tested.<\/em><\/p>\n<p><strong><a href=\"http:\/\/www.fotoevidence.com\" target=\"_blank\" rel=\"noopener noreferrer\">FotoEvidence Book Award<\/a><\/strong><\/p>\n<p><em>The annual FotoEvidence Book Award will recognize a documentary photographer whose project demonstrates courage and commitment in addressing a violation of human rights, a significant injustice or an assault on human dignity. The selected project will be published in a book, as part of a series of FotoEvidence books dedicated to the work of photographers whose commitment and courage create an awareness of social injustice. FotoEvidence will offer to collaborate with one of the finalists to crowdfund the publication of their work.<\/em><\/p>\n","protected":false},"excerpt":{"rendered":"<p>Our list of International Photography Grants and Funds in 2021 for student, amateur and professional photographers: International Photography Grant 2021 International Photography Grant awards $1000 annually to the applicant with the most inspirational photographic idea to support his visual project. Our grant is open for submissions without any fees (Free to Enter) to support all [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":0,"parent":0,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":{"footnotes":""},"aioseo_notices":[],"_links":{"self":[{"href":"https:\/\/photocontestdeadlines.com\/wp-json\/wp\/v2\/pages\/742"}],"collection":[{"href":"https:\/\/photocontestdeadlines.com\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/photocontestdeadlines.com\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/photocontestdeadlines.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/photocontestdeadlines.com\/wp-json\/wp\/v2\/comments?post=742"}],"version-history":[{"count":11,"href":"https:\/\/photocontestdeadlines.com\/wp-json\/wp\/v2\/pages\/742\/revisions"}],"predecessor-version":[{"id":7709,"href":"https:\/\/photocontestdeadlines.com\/wp-json\/wp\/v2\/pages\/742\/revisions\/7709"}],"wp:attachment":[{"href":"https:\/\/photocontestdeadlines.com\/wp-json\/wp\/v2\/media?parent=742"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}